**Filter**

In [3]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'gruplar':["A","B","C","A","B","C"],
                  'degisken1':[10,20,30,40,50,60],
                  'degisken2':[100,200,300,400,500,600]},
                   columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         20        200
2       C         30        300
3       A         40        400
4       B         50        500
5       C         60        600

In [4]:
def filter_func(x):
    return x['degisken1'].std() > 9

In [6]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A        21.213203  212.132034
B        21.213203  212.132034
C        21.213203  212.132034

In [5]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10        100
1       B         20        200
2       C         30        300
3       A         40        400
4       B         50        500
5       C         60        600